package com.lanier.rocoworld.database

import com.lanier.rocoworld.database.model.Property
import com.lanier.rocoworld.database.model.Spirit

object TempData {

    val properties = mutableListOf<Property>().apply {
        add(Property("1", "恶"))
        add(Property("1", "翼"))
        add(Property("1", "幽"))
        add(Property("1", "草"))
        add(Property("1", "普通"))
        add(Property("1", "光"))
        add(Property("1", "毒"))
        add(Property("1", "虫"))
    }

    val spirits = mutableListOf<Spirit>().apply {
        add(
            Spirit.build(
                "恶魔叮",
                "1,2",
                "0.39-0.56",
                "3.6-4.1",
                "常见于草地、树林",
                "身体里似乎装满了坏心思，试图抓住它的话很轻松就能挣脱。",
                "会三五成群地从洛克手上抢走东西，把东西丢下之后嘻嘻哈哈地飞走。"
            )
        )
        add(
            Spirit.build(
                "幽影树",
                "3,4",
                "0.64-0.92",
                "29.5-37.5",
                "行踪有些难以捉摸",
                "左手和右手似乎有独自的想法，在黑暗中看起来就像三只精灵。",
                "有时候会静止不动伪装成普通树木的样子，虽然任谁都一眼就能被识破。"
            )
        )
        add(
            Spirit.build(
                "恶魔叮",
                "1,2",
                "0.39-0.56",
                "3.6-4.1",
                "常见于草地、树林",
                "身体里似乎装满了坏心思，试图抓住它的话很轻松就能挣脱。",
                "会三五成群地从洛克手上抢走东西，把东西丢下之后嘻嘻哈哈地飞走。"
            )
        )
        add(
            Spirit.build(
                "冬羽雀",
                "2",
                "0.39-0.52",
                "2.6-3.8",
                "常见于草地、荒原、雪山",
                "体型又小又圆，眼睛周围生长着一层柔软绒毛。",
                "成长过程中会在冬天褪一次毛，它褪下的羽毛是一种非常珍贵的魔法道具。"
            )
        )
        add(
            Spirit.build(
                "鸭吉吉",
                "5",
                "0.65-0.94",
                "5.6-8.2",
                "行踪有些难以捉摸",
                "拥有极其柔软的被毛。似乎很讨厌肢体接触，非常抗拒被抚摸。",
                "非常聪慧的物种，对环境中与众不同的东西十分敏感，尤其对于闪光的物体和新奇的事物格外感兴趣。"
            )
        )
        add(
            Spirit.build(
                "迪莫",
                "6",
                "0.54-0.78",
                "5.5-7.0",
                "常见于草地、树林",
                "充满勇气的伙伴，有一种熟悉却又神秘的感觉。",
                "在特殊魔力的影响下，会改变自身的身体构造。"
            )
        )
        add(
            Spirit.build(
                "圆眼蜘蛛",
                "8,7",
                "0.48-0.68",
                "3.5-5",
                "常见于山洞、草地",
                "幼体的圆眼蜘蛛并不太能织网捕食，多以青草，树果为食。",
                "复眼获取信息范围极大，速度极快，即便是独眼的圆眼蜘蛛获取信息速度远超过洛克族1000倍。"
            )
        )
        add(
            Spirit.build(
                "奇丽草",
                "4",
                "0.38-0.55",
                "4.1-5.7",
                "常见于草地",
                "巨大的花朵盛开了，它的花瓣像是一顶遮阳帽，花朵很好闻。",
                "粗大的花蕊像触角一样，气味极其香甜，对小型精灵有强烈吸引力，但其实是覆满剧毒的武器。"
            )
        )
        add(
            Spirit.build(
                "旋叶虫",
                "5,8",
                "0.39-0.56",
                "0.15-0.25",
                "常见于荒林",
                "又名木叶虫，经常挂在树上，是技术很高超的伪装精灵，不仔细观察的话很难发现它们的踪迹。",
                "以类似树叶而闻名，颜色、形状，叶脉、叶梗，甚至是破损处也都非常相似。"
            )
        )
        add(
            Spirit.build(
                "厉毒小萝",
                "7,1",
                "0.55-0.65",
                "12.5-14.8",
                "行踪有些难以捉摸",
                "体味清香，翼下藏有数个腺体，能够发射致洛克晕厥的毒雾。受惊时将双翼展为扇形，倾泻毒雾后迅速逃离。",
                ""
            )
        )
    }
}